import java.io.*;
import java.io.FileInputStream;
import java.io.ObjectInputStream;
import java.io.FileOutputStream;
import java.io.IOException;
import java.io.ObjectOutputStream;
import java.io.Serializable;

// αυτη η κλαση αντιπροσωπευει ενα αντικειμενο classicsudoku π περιεχει τα 10 σουντοκου π θα μπορει να παιξει ο χρηστης

public class ClassicSudoku implements Serializable{
    private int[][] arr1;
    private int[][] arr2;
    private int[][] arr3;
    private int[][] arr4;
    private int[][] arr5;
    private int[][] arr6;
    private int[][] arr7;
    private int[][] arr8;
    private int[][] arr9;
    private int[][] arr10;

    //αρχικοποιει τα 10 sudoku
    public ClassicSudoku() {
        arr1= new int[][]{
                {0, 0, 5, 3, 0, 0, 0, 6, 7},
                {9, 0, 0, 0, 2, 7, 0, 0, 0},
                {0, 0, 7, 9, 4, 6, 5, 1, 0},
                {0, 0, 3, 1, 0, 9, 0, 0, 4},
                {0, 0, 0, 0, 6, 0, 0, 0, 0},
                {6, 0, 0, 4, 0, 3, 2, 0, 0},
                {0, 1, 2, 6, 3, 4, 8, 0, 0},
                {0, 0, 0, 8, 7, 0, 0, 0, 3},
                {5, 3, 0, 0, 0, 1, 7, 0, 0}
        };
        arr2= new int[][]{
                {0, 1, 9, 8, 0, 7, 5, 4, 0},
                {3, 0, 8, 0, 1, 0, 0, 0, 0},
                {6, 0, 0, 3, 0, 2, 0, 9, 8},
                {0, 0, 0, 0, 0, 4, 0, 0, 5},
                {0, 9, 3, 0, 0, 0, 6, 7, 0},
                {7, 0, 0, 6, 0, 0, 0, 0, 0},
                {5, 3, 0, 2, 0, 9, 0, 0, 7},
                {0, 0, 0, 0, 3, 0, 8, 0, 9},
                {0, 8, 4, 7, 0, 1, 3, 2, 0}
        };
        arr3= new int[][]{
                {0, 0, 6, 0, 0, 0, 9, 0, 2},
                {8, 0, 0, 0, 0, 0, 0, 0, 0},
                {3, 9, 2, 5, 6, 4, 0, 0, 1},
                {0, 4, 0, 0, 0, 3, 1, 9, 0},
                {9, 0, 3, 0, 1, 0, 7, 0, 4},
                {0, 1, 7, 6, 0, 0, 0, 5, 0},
                {4, 0, 0, 7, 3, 6, 2, 1, 9},
                {0, 0, 0, 0, 0, 0, 0, 0, 3},
                {6, 0, 9, 0, 0, 0, 5, 0, 0}
        };
        arr4= new int[][]{
                {0, 0, 0, 0, 0, 7, 0, 2, 0},
                {0, 3, 0, 0, 9, 0, 0, 0, 5},
                {8, 0, 0, 5, 0, 1, 0, 3, 6},
                {1, 0, 3, 8, 0, 0, 5, 9, 2},
                {0, 0, 8, 0, 1, 0, 6, 0, 0},
                {7, 5, 6, 0, 0, 9, 3, 0, 1},
                {6, 1, 0, 9, 0, 3, 0, 0, 4},
                {2, 0, 0, 0, 6, 0, 0, 7, 0},
                {0, 9, 0, 7, 0, 0, 0, 0, 0}
        };
        arr5= new int[][]{
                {4, 3, 0, 0, 0, 0, 0, 7, 0},
                {1, 0, 0, 9, 7, 8, 3, 4, 6},
                {0, 0, 0, 0, 0, 0, 0, 0, 5},
                {0, 1, 3, 6, 0, 0, 9, 0, 0},
                {9, 2, 0, 0, 1, 0, 0, 6, 3},
                {0, 0, 8, 0, 0, 7, 1, 2, 0},
                {6, 0, 0, 0, 0, 0, 0, 0, 0},
                {3, 4, 1, 7, 6, 2, 0, 0, 9},
                {0, 8, 0, 0, 0, 0, 0, 3, 7}
        };
        arr6= new int[][]{
                {3, 6, 2, 0, 0, 8, 9, 0, 0},
                {7, 0, 8, 0, 0, 0, 2, 0, 0},
                {0, 4, 0, 2, 0, 0, 8, 0, 6},
                {0, 0, 5, 3, 0, 6, 4, 0, 0},
                {4, 0, 0, 0, 1, 0, 0, 0, 8},
                {0, 0, 3, 8, 0, 4, 1, 0, 0},
                {8, 0, 4, 0, 0, 3, 0, 2, 0},
                {0, 0, 7, 0, 0, 0, 3, 0, 9},
                {0, 0, 9, 1, 0, 0, 6, 5, 4}
        };
        arr7= new int[][]{
                {0, 0, 0, 0, 0, 0, 6, 5, 1},
                {0, 5, 2, 7, 0, 0, 0, 8, 0},
                {0, 9, 1, 0, 0, 3, 0, 7, 0},
                {0, 0, 5, 6, 1, 0, 9, 0, 0},
                {0, 6, 0, 0, 3, 0, 0, 4, 0},
                {0, 0, 3, 0, 5, 9, 7, 0, 0},
                {0, 2, 0, 3, 0, 0, 8, 1, 0},
                {0, 1, 0, 0, 0, 6, 4, 3, 0},
                {7, 3, 6, 0, 0, 0, 0, 0, 0}
        };
        arr8= new int[][]{
                {0, 9, 0, 0, 0, 0, 0, 0, 0},
                {1, 0, 3, 0, 7, 5, 0, 9, 2},
                {7, 0, 5, 9, 2, 1, 8, 4, 0},
                {0, 0, 0, 1, 5, 0, 0, 0, 8},
                {0, 0, 4, 0, 0, 0, 9, 0, 0},
                {9, 0, 0, 0, 4, 7, 0, 0, 0},
                {0, 1, 2, 5, 3, 6, 7, 0, 9},
                {5, 7, 0, 2, 1, 0, 3, 0, 4},
                {0, 0, 0, 0, 0, 0, 0, 1, 0}
        };
        arr9= new int[][]{
                {0, 4, 8, 3, 1, 0, 0, 0, 7},
                {6, 0, 1, 2, 4, 0, 3, 0, 0},
                {0, 0, 3, 0, 0, 5, 0, 0, 0},
                {3, 0, 0, 0, 0, 0, 0, 0, 6},
                {2, 5, 4, 6, 0, 3, 7, 9, 1},
                {1, 0, 0, 0, 0, 0, 0, 0, 4},
                {0, 0, 0, 5, 0, 0, 9, 0, 0},
                {0, 0, 5, 0, 3, 8, 4, 0, 2},
                {8, 0, 0, 0, 2, 4, 6, 1, 0}
        };
        arr10= new int[][]{
                {0, 0, 7, 0, 6, 0, 5, 3, 0},
                {0, 0, 0, 3, 0, 8, 0, 0, 0},
                {0, 0, 0, 0, 9, 0, 0, 8, 4},
                {2, 0, 0, 9, 0, 0, 7, 1, 5},
                {3, 0, 1, 5, 0, 2, 4, 0, 8},
                {5, 8, 7, 0, 0, 4, 0, 0, 2},
                {4, 5, 0, 0, 3, 0, 0, 0, 0},
                {0, 0, 0, 8, 0, 6, 0, 0, 0},
                {0, 1, 3, 0, 5, 0, 0, 4, 0}
        };

    }


    //επιστρεφει το sudoku 1
    public int[][] getArr1() {
        return arr1;
    }

    //επιστρεφει το sudoku 2
    public int[][] getArr2() {
        return arr2;
    }

    //επιστρεφει το sudoku 3
    public int[][] getArr3() {
        return arr3;
    }

    //επιστρεφει το sudoku 4
    public int[][] getArr4() {
        return arr4;
    }

    //επιστρεφει το sudoku 5
    public int[][] getArr5() {
        return arr5;
    }

    //επιστρεφει το sudoku 6
    public int[][] getArr6() {
        return arr6;
    }

    //επιστρεφει το sudoku 7
    public int[][] getArr7() {
        return arr7;
    }

    //επιστρεφει το sudoku 8
    public int[][] getArr8() {
        return arr8;
    }

    //επιστρεφει το sudoku 9
    public int[][] getArr9() {
        return arr9;
    }

    //επιστρεφει το sudoku 10
    public int[][] getArr10() {
        return arr10;
    }

    //γραφει σε αρχειο ενα αντικειμενο με τα 10 σουντοκου
    public void WriteClassicSudoku() throws Exception {
        ObjectOutputStream out = new ObjectOutputStream(new FileOutputStream("ClassicSudokuFile.txt"));

        try {
            ClassicSudoku object = new ClassicSudoku();
            out.writeObject(object);
        } catch (Throwable var5) {
            try {
                out.close();
            } catch (Throwable var4) {
                var5.addSuppressed(var4);
            }
            throw var5;
        }
        out.close();
    }




}
